#1. Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

print("Укажите значения переменных:")

int1 = int(input("Целое число №1 = "))
int2 = int(input("Целое число №2 = "))

float1 = int(input("Дробное число №1 = "))
float2 = int(input("Дробное число №2 = "))

str1 = int(input("Строка №1 = "))
str2 = int(input("Строка №2 = "))

print("")
print("Результаты:")
print("Целое число №1 = ", int1)
print("Целое число №2 = ", int2)

print("Дробное число №1 = ", float1)
print("Дробное число №2 = ", float2)

print("Строка №1 = ", str1)
print("Строка №2 = ", str2)